package IT_Class.M25_Multithreading;

public class _HW2 {
}
/*
public class ControlTest {

@Test
    public void test1a() throws IOException {
        Collection<String> collection = Arrays.asList("a1", "a2", "a3", "a1", "b1");
        // Проверить первый элемент коллекции,
        // последний элемент коллекции,
        // число элементов,
        // проверить, существует ли элемент
        //Выбрать элемент по шаблону regex, чтобы строка начиналась на 'b'

    }

    @Test
    public void test1() throws IOException {
        //Используя stream, записать в файл последовательность строк "a1,b2,c3,d4...z26"
        //Прочитать данные из файла. Проверить первую и последнюю записанные строки

    }

    @Test
    public void test1b() throws IOException {
        // Выбрать мужчин от 20 до 30 лет
        // Найти средний возраст среди мужчин
        // Найти количество трудоспособных (т.е. от 18 лет и учитывая что женщины выходят в 55 лет, а мужчина в 60)
        // Найти человека с максимальным возрастом
        // Отсортировать по имени в обратном алфавитном порядке
	// Отсортировать сначала по полу, а потом по возрасту
        //Группировка по полу

    }

    @Test
    public void test2() {
        Collection<String> collection = Arrays.asList("a1", "a2", "a3", "a1");
        // Получить все числа подряд, записать в массив целых чисел
        // Получить все числа подряд, записать в массив строк
        //Найти сумму всех чисел, которые хранятся через запятую в collection
    }
}
 */
