package IT_Class.M25_Multithreading;

/*
1. Дана прямоугольная область nxm, заполненная нулями
0 0 0 0
0 0 0 0
0 0 0 0

В эту область добавляется один или более "активных" элементов, которые
при каждом последующем ходе "закрашивают" соседние элементы в свой цвет.
Например, добавлены элементы 1 и 2:
1 0 0 0
0 0 0 2
0 0 0 0

На следующем ходе они закрасят соседние элементы так, что
1 1 2 2
1 1 2 2
0 0 2 2

На последнем ходе первым "ходит" элемент 1, поэтому область закрашивается так:
1 1 2 2
1 1 2 2
1 1 2 2

Определить, за сколько ходов закрасится вся область.
Предусмотреть вывод в консоль всех ходов или только начальное и конечное состояние области.
Предусмотреть опцию, которая позволяет изменить правила игры так, чтобы
диагональные элементы не закрашивались.
Например,
1 0 0 0
0 0 0 2
0 0 0 0

1 1 0 0
1 0 2 2
0 0 0 2

1 1 1 2
1 1 2 2
1 0 2 2

1 1 1 2
1 1 2 2
1 1 2 2
 */
public class _Painting {
    public static void main(String[] args) {

    }
}

