package IT_Class.M25_Multithreading;

/*
2. На поле размером nxm размещены корабли (2 трехпалубных, 3 двухпалубных, 4 однопалубных)
        [[0,0,0,1,1,0],
         [0,1,0,0,0,0],
         [0,1,0,1,0,0],
         [0,1,0,1,0,0]];

При ходе [2, 1] программа выдает число 3, т.к. подбит трехпалубный корабль
При ходе [1, 3] программа выдает число 0 (промах) и т.д.
Изменить условие так, чтобы каждый из кораблей мог "отразить" одну атаку,
выдав 0 при первом попадании в него.
Разработать алгоритм, который подобьет все корабли если не за минимальное,
то за некоторое удовлетворительное число ходов.
 */
public class _SeaBattle {
    public static void main(String[] args) {

    }
}