package M06_TablKarno;
/*
Фишки. Имеется квадратная доска nxn, на крайние поля которой выставлены фишки.
Дано k - количество фишек.
Можно ли разместить все эти фишки, чтобы они заняли все крайние поля доски?
Например, на доску 2x2 можно выставить 4 фишки, а на доску 5x5 - 16.
*/
public class Chips {
    public static void main(String[] args) {
        int n = 5;
        System.out.println((n-1)*4);
    }

}