
package HomeWorks.HomeWork23_11_23;

public class Task_04 {
    public static void main(String[] args) {
        //Написать программу, которая выведет на консоль «Hello
        //world», не используя в исходном коде пробельных символов.
        System.out.println("Hello\nworld");
    }
}