package IT_Class.M18_Recursion;
/*
Решите две из предложенных задач.
1. Дан массив целых чисел, в котором каждый элемент равен его индексу, например [0,1,2].
Вывести все перестановки его n элементов, в которых элементы a и b не соседствуют.

2. Дан массив целых чисел, в котором каждый элемент равен его индексу, например [0,1,2].
Вывести все перестановки его n элементов, в которых ни один элемент не находится на своем месте.

3. В кафе есть меню из двух видов блюд на первое, трех - на второе и двух - на третье.
Выведите все возможные сочетания заказов из двух или трех блюд. Названия блюд подберите.

4. В кошельке есть набор монет. Вывести перебором все возможные подмножества монет для оплаты заданной суммы.

5. В урне находится 4 карточки с числами от 1 до 4.
При выборе 3-х карточек карточку можно возвращать обратно в урну и выбирать снова.
Выведите все возможные комбинации такого выбора.
 */
public class HomeWorks {
}

