package _Java.IT_Class.M09_Arrays;

import java.util.Arrays;
import java.util.Random;

/*
Сгенерировать возрастающую последовательность.
Сгенерировать последовательность в интервале 1..9 и перемешать ее.
Найти общие элементы в двух целочисленных массивах.
Удалить повторяющиеся элементы из массива.
Найти второй (после максимального) по величине элемент массива.
Найти все пары элементов массива, чья сумма равна заданному числу.
Дано два массива, элементы которых неупорядочены. Сравнить эти два массива.
Найти отсутствующее в массиве число.
Переместить все нулевые элементы в конец массива, не изменяя при этом порядок остальных элементов.
Вывести самую длинную последовательность чисел в массиве, в которой каждый последующий элемент больше
предыдущего на единицу. Исходный массив не отсортирован.
Найти мажоритарный элемент массива. Мажоритарным назовем такой элемент, число повторений которого в массиве
равно n/2, где n - длина массива.
Вывести все элементы-лидеры в массиве. Лидером назовем такой элемент, который больше всех элементов справа от него.
 */
public class TaskLev2 {
    public static void main(String[] args) {
        int n = 10;
        int[] arr = new int[n]; //Создать массив длины n
        Random random = new Random();
        arr[0] = random.nextInt(5)+1; //1..5
        for (int i=1; i<arr.length; i++)
            arr[i] = arr[i-1]+random.nextInt(5)+1;
        System.out.println(Arrays.toString(arr));
        System.out.println(Arrays.stream(arr).max().orElse(0));

        //Найти максимальный элемент в вмассиве
        int max = arr[0];
        for (int elem:arr)
            if (max<elem) max = elem;
        System.out.println(max);
    }
}

